# refer to flownet name: "adjust_layer"
name: "vgg_layer"
force_backward: true
input: "fea_map1"
input_dim: 1
input_dim: 512   #
input_dim: 7  #105#
input_dim: 5  #162#
input: "fea_map2"
input_dim: 1
input_dim: 512   #
input_dim: 7  #105#
input_dim: 5  #162#
#layer {  name: "conv4_3_global_pool"  type: "Pooling"  bottom: "fea_map1"   top: "conv4_3_global_pool"
#  pooling_param { pool: AVE     engine: CAFFE     global_pooling: true   }}
#layer {  name: "conv4_3_1x1_down"   type: "Convolution"   bottom: "conv4_3_global_pool"   top: "conv4_3_1x1_down"
#  param { name: "conv4_3_1x1_down_w" lr_mult: 0 }  param { name: "conv4_3_1x1_down_b" lr_mult: 2 } convolution_param { num_output: 128     kernel_size: 1     stride: 1  weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   }  }}
#layer {   name: "conv4_3_1x1_down/relu"   type: "ReLU"   bottom: "conv4_3_1x1_down"   top: "conv4_3_1x1_down"}
#layer {  name: "conv4_3_1x1_up"   type: "Convolution"   bottom: "conv4_3_1x1_down"   top: "conv4_3_1x1_up"
 # param { name: "conv4_3_1x1_up_w" lr_mult: 0 }  param { name: "conv4_3_1x1_up_b" lr_mult: 2 } convolution_param {    num_output: 512    kernel_size: 1     stride: 1   weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   } }}
#layer {  name: "conv4_3_prob"  type: "Sigmoid"   bottom: "conv4_3_1x1_up"   top: "conv4_3_1x1_up" }
#layer {  name: "conv4_3_prob_reshape"   type: "Reshape"  bottom: "conv4_3_1x1_up"   top: "conv4_3_prob_reshape"
#  reshape_param { shape {  dim: 0      dim: 0   }  }}
#layer {  name: "conv4_3_scale"  type: "Scale"   bottom: "fea_map1"   bottom: "conv4_3_prob_reshape"   top: "conv4_3_output"
#  scale_param {     axis: 0     bias_term: false   } }
#layer {  name: "conv5_3_global_pool"  type: "Pooling"  bottom: "fea_map2"   top: "conv5_3_global_pool"
#  pooling_param { pool: AVE     engine: CAFFE     global_pooling: true   }}
#layer {  name: "conv5_3_1x1_down"   type: "Convolution"   bottom: "conv5_3_global_pool"   top: "conv5_3_1x1_down"
#  param { name: "conv5_3_1x1_down_w" lr_mult: 0 }  param { name: "conv5_3_1x1_down_b" lr_mult: 2 } convolution_param { num_output: 128     kernel_size: 1     stride: 1  weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   } }}
#layer {   name: "conv5_3_1x1_down/relu"   type: "ReLU"   bottom: "conv5_3_1x1_down"   top: "conv5_3_1x1_down"}
#layer {  name: "conv5_3_1x1_up"   type: "Convolution"   bottom: "conv5_3_1x1_down"   top: "conv5_3_1x1_up"
#  param { name: "conv5_3_1x1_up_w" lr_mult: 0 }  param { name: "conv5_3_1x1_up_b" lr_mult: 2 } convolution_param {    num_output: 512    kernel_size: 1     stride: 1   weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   } }}
#layer {  name: "conv5_3_prob"  type: "Sigmoid"   bottom: "conv5_3_1x1_up"   top: "conv5_3_1x1_up" }
#layer {  name: "conv5_3_prob_reshape"   type: "Reshape"  bottom: "conv5_3_1x1_up"   top: "conv5_3_prob_reshape"
#  reshape_param { shape {  dim: 0      dim: 0   }  }}
#layer {  name: "conv5_3_scale"  type: "Scale"   bottom: "fea_map2"   bottom: "conv5_3_prob_reshape"   top: "conv5_3_output"
#  scale_param {     axis: 0     bias_term: false   } }
layer {   name: "feature_red1"   type: "Convolution"   bottom: "fea_map1"   top: "feature_red1"   
  param { name: "feature_red1_w" lr_mult: 0 }   convolution_param {  num_output: 128   bias_term: false   pad: 1   kernel_size: 3     stride: 1    weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   }   }}
layer {   name: "feature_red2"   type: "Convolution"   bottom: "fea_map2"   top: "feature_red2"   
  param { name: "feature_red2_w" lr_mult: 0 }    convolution_param {  num_output: 128     bias_term: false   pad: 1   kernel_size: 3     stride: 1    weight_filler {   type: "msra"  }    bias_filler {   type: "constant"   }   }}
layer { name: "P4"    type: "Eltwise"    bottom: "feature_red1"    bottom: "feature_red2"    top: "P4"    eltwise_param { operation: SUM  coeff: 0.8  coeff: 0.2}}
layer {  bottom: "P4"  top: "conv6_1"  name: "conv6_1"  type: "Convolution" param {  name: "conv6_1_w"  lr_mult: 1  decay_mult: 1 }  param {   name: "conv6_1_b"  lr_mult: 2 decay_mult:0}   convolution_param {  weight_filler {type: "gaussian" std:1e-7} bias_filler {type: "constant" value: 0}   num_output: 1    pad: 0   
kernel_h: 1 
kernel_w: 7   
}}
layer {  bottom: "feature_red2"  top: "conv6_2"  name: "conv6_2"  type: "Convolution" param {  name: "conv6_2_w"  lr_mult: 40  decay_mult:40 }  param {   name: "conv6_2_b"  lr_mult: 40 decay_mult:0}   convolution_param {  weight_filler {type: "gaussian" std:1e-7} bias_filler {type: "constant" value: 0}   num_output: 1    pad: 0   
kernel_h: 1 
kernel_w: 7   
}}
layer { name: "response"    type: "Eltwise"    bottom: "conv6_1"    bottom: "conv6_2"    top: "response"    eltwise_param { operation: SUM  coeff: 1  coeff: 1}}