# design for triplet stream network
name: "TwoflowDeconv"
force_backward: true
input: "examplar"
input_dim: 10
input_dim: 3
input_dim: 127
input_dim: 127

input: "instance"
input_dim: 10
input_dim: 3
input_dim: 239#255
input_dim: 239#255

layer {
  name: "aconv1"
  type: "Convolution"
  bottom: "examplar"
  top: "conv1"
  param {
  name: "conv1_w"
  lr_mult: 0 
  }
  param {
  name: "conv1_b"
  lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.00001
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  top:"pool1_mask" 
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "aconv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
  name: "conv2_w"
  lr_mult: 0 
  }
  param {
  name: "conv2_b"
  lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  top:"pool2_mask" 
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "aconv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "aconv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    name: "conv4_w"
    lr_mult: 0
  }
  param {
    name: "conv4_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "aconv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
  name: "conv5_w"
  lr_mult: 0 
  }
  param {
  name: "conv5_b"
  lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
################################################################
layer {
  name: "loc_conv1"
  type: "Convolution"
  bottom: "instance"
  top: "loc_conv1"
  param {
  name: "conv1_w"
  lr_mult: 0 
  }
  param {
  name: "conv1_b"
  lr_mult: 0
  }
 convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_relu1"
  type: "ReLU"
  bottom: "loc_conv1"
  top: "loc_conv1"
}
layer {
  name: "loc_pool1"
  type: "Pooling"
  bottom: "loc_conv1"
  top: "loc_pool1"
  top: "loc_pool1_mask"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "loc_norm1"
  type: "LRN"
  bottom: "loc_pool1"
  top: "loc_norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "loc_conv2"
  type: "Convolution"
  bottom: "loc_norm1"
  top: "loc_conv2"
  param {
  name: "conv2_w"
  lr_mult: 0 
  }
  param {
  name: "conv2_b"
  lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "loc_relu2"
  type: "ReLU"
  bottom: "loc_conv2"
  top: "loc_conv2"
}
layer {
  name: "loc_pool2"
  type: "Pooling"
  bottom: "loc_conv2"
  top: "loc_pool2"
  top: "loc_pool2_mask"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "loc_conv3"
  type: "Convolution"
  bottom: "loc_pool2"
  top: "loc_conv3"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_relu3"
  type: "ReLU"
  bottom: "loc_conv3"
  top: "loc_conv3"
}
layer {
  name: "loc_conv4"
  type: "Convolution"
  bottom: "loc_conv3"
  top: "loc_conv4"
  param {
    name: "conv4_w"
    lr_mult: 0
  }
  param {
    name: "conv4_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 384
    pad:0
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "loc_relu4"
  type: "ReLU"
  bottom: "loc_conv4"
  top: "loc_conv4"
}
layer {
  name: "loc_conv5"
  type: "Convolution"
  bottom: "loc_conv4"
  top: "loc_conv5"
  param {
  name: "conv5_w"
  lr_mult: 0 
  }
  param {
  name: "conv5_b"
  lr_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
  }
}
layer {
  name: "loc_relu5"
  type: "ReLU"
  bottom: "loc_conv5"
  top: "loc_conv5"
}
#############################################################################
layer {
  name: "deconv5"
  type: "Deconvolution"
  bottom: "conv5"
  top: "deconv5"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "derelu5"
  type: "ReLU"
  bottom: "deconv5"
  top: "deconv5"
}
layer {
  name: "deconv4"
  type: "Deconvolution"
  bottom: "deconv5"
  top: "deconv4"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "derelu4"
  type: "ReLU"
  bottom: "deconv4"
  top: "deconv4"
}
layer {
  name: "deconv3"
  type: "Deconvolution"
  bottom: "deconv4"
  top: "deconv3"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "derelu3"
  type: "ReLU"
  bottom: "deconv3"
  top: "deconv3"
}
# unpool1
layer { type: "Unpooling"  bottom: "deconv3"  bottom: "pool2_mask"  top: "unpool2"  name: "unpool2"
  unpooling_param {   unpool: MAX   kernel_size: 3    stride: 2   unpool_size: 15 }
}
layer {
  name: "deconv2"
  type: "Deconvolution"
  bottom: "unpool2"
  top: "deconv2"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "derelu2"
  type: "ReLU"
  bottom: "deconv2"
  top: "deconv2"
}
# unpool1
layer { type: "Unpooling"  bottom: "deconv2"  bottom: "pool1_mask"  top: "unpool1"  name: "unpool1"
  unpooling_param {   unpool: MAX   kernel_size: 2    stride: 2   unpool_size: 30 }
}
layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "unpool1"
  top: "deconv1"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "derelu1"
  type: "ReLU"
  bottom: "deconv1"
  top: "deconv1"
}
###############################################################
layer {
  name: "loc_deconv5"
  type: "Deconvolution"
  bottom: "loc_conv5"
  top: "loc_deconv5"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_derelu5"
  type: "ReLU"
  bottom: "loc_deconv5"
  top: "loc_deconv5"
}
layer {
  name: "loc_deconv4"
  type: "Deconvolution"
  bottom: "loc_deconv5"
  top: "loc_deconv4"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_derelu4"
  type: "ReLU"
  bottom: "loc_deconv4"
  top: "loc_deconv4"
}
layer {
  name: "loc_deconv3"
  type: "Deconvolution"
  bottom: "loc_deconv4"
  top: "loc_deconv3"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_derelu3"
  type: "ReLU"
  bottom: "loc_deconv3"
  top: "loc_deconv3"
}
# unpool1
layer { type: "Unpooling"  bottom: "loc_deconv3"  bottom: "loc_pool2_mask"  top: "loc_unpool2"  name: "loc_unpool2"
  unpooling_param {   unpool: MAX   kernel_size: 3    stride: 2   unpool_size: 29 }
}
layer {
  name: "loc_deconv2"
  type: "Deconvolution"
  bottom: "loc_unpool2"
  top: "loc_deconv2"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_derelu2"
  type: "ReLU"
  bottom: "loc_deconv2"
  top: "loc_deconv2"
}
# unpool1
layer { type: "Unpooling"  bottom: "loc_deconv2"  bottom: "loc_pool1_mask"  top: "loc_unpool1"  name: "loc_unpool1"
  unpooling_param {   unpool: MAX   kernel_size: 2    stride: 2   unpool_size: 58 }
}
layer {
  name: "loc_deconv1"
  type: "Deconvolution"
  bottom: "loc_unpool1"
  top: "loc_deconv1"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loc_derelu1"
  type: "ReLU"
  bottom: "loc_deconv1"
  top: "loc_deconv1"
}
#layer {
#  name: "corr"
#  type: "Correlation"
#  bottom: "loc_deconv1"
#  bottom: "deconv1"
#  top: "corr"
#  correlation_param {
#    pad: 0
#    kernel_size: 1
#    max_displacement: 63
#    stride_1: 1
#    stride_2: 1
#  }
#}
